Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/the_asylum_process_in_ireland/how_refugee_applications_commissioner_deals_with_applications.html.txt.tmx
Source language: en
Languages: ga

source: Assessment and examination of applications for international protection in Ireland
ga: Fiosrú na niarratas ag Coimisinéir Iarratais do Dhídeanaithe

source: • Examination of your application
ga: • Cá háit a ndéanfaidh mé iarratas

source: The international protection officer will then make a recommendation based on the examination and send it to the Minister for Justice and Equality, who will notify you about the recommendation
ga: Fógrófar duit i scríbhinn faoi am, dáta agus áit le freastal ar agallamh i ndáil le d'iarratas

source: When your application is being assessed and examined, you have a duty to:
ga: Déanfar gach iarracht réasúnta chun teangaire a sholáthar má bhíonn ceann de dhíth ort

source: • Provide all the information and details relevant to your particular circumstances • Co-operate in the assessment and examination of your application
ga: Ba chóir duit an teanga a bheadh de dhíth ort a chur in iúl nuair a bhíonn tú ag deimhniú d’fhreastail ar agallamh

source: Under section 28 of the Act, an international protection officer will assess your statements and all other documents providing information such as your age, identity, country or countries of previous residence, previous asylum applications, travel routes and your reasons for applying for international protection
ga: Má mhainníonn tú freastal ar agallamh ar an dáta agus an am socraithe agus má mhainníonn tú míniú a thabhairt don Choimisinéir Iarratais do Dhídeanaithe tráth nach déanaí ná 3 lá oibre ón dáta sin ar chúis atá réasúnta i dtuairim an Choimisinéara, measfar d’iarratas a bheith aistarraingthe agus diúltóidh an tAire dearbhú a thabhairt duitse

source: When carrying out the assessment, the international protection officer will take the following into account:
ga: Maidir le d’agallamh (ar a dtugtar agallamh substainteach)

source: • All relevant facts relating to your country of origin
ga: • Is é cuspóir an agallaimh ná mionsonraí iomlána d’éilimh ar dhearbhú mar dhídeanaí a bhunú

source: • Relevant statements and documentation presented by you, including information as to whether you have been or may be subject to persecution or serious harm
ga: • Ba cheart duit míniú go soiléir agus go beacht d’ábhair eagla agus gach faisnéis agus mionsonraí ar ábhartha do do chúinsí féin iad

source: • Your position and personal circumstances
ga: • Is í do dheis í an t-agallamh chun an fáth a mhíniú go mionsonrach gur eagal duit filleadh ar do thír bhunaidh

source: • Whether your activities since leaving your country of origin were engaged in to create conditions allowing you to apply for international protection
ga: • Is é do dhualgas comhoibriú go hiomlán agus bheith go hiomlán fírinneach

source: • Whether you could obtain the protection of another country where you could claim citizenship
ga: D’fhéadfá moladh diúltach a fháil mura ndéanfaidh tú amhlaidh

source: If you have already been subject to persecution or serious harm you may not have documentary or other evidence to support this. In this situation, the international protection officer will not need confirmation of this if convinced that:
ga: • Tá oiliúint iomlán faighte ag an Oifigeach Údaraithe a dhéanfaidh an t-agallamh leat thar ceann Choimisinéir Iarratais do Dhídeanaithe; is ó Ard-Choimisinéir na Náisiún Aontaithe do Theifigh (UNHCR) atá an oiliúint sin i ndaoine a chur faoi agallamh a bhíonn ag lorg dearbhú mar theifeach agus beidh faisnéis mhionsonraithe ar fáil dóibh faoi do thír bhunaidh

source: • You made a genuine effort to prove what you said in your application
ga: • Coinneoidh an t-agallóir taifead scríofa den agallamh

source: • You provided all the evidence you had available and gave a reasonable explanation for not having other relevant evidence
ga: Beidh deis agat an taifead a athbhreithniú agus iarrfar ort gach leathanach a shíniú lena chinntiú gur cuntas cruinn é de d’agallamh

source: • Your statements were coherent and plausible
ga: Síneoidh an t-agallóir gach leathanach chomh maith

source: • If you did not apply for international protection at the earliest possible time, you gave a reasonable explanation for not doing so •Your general credibility has been established Examination of your application
ga: Má bhraitheann tú nach cruinn aon ní atá scríofa síos, tabharfar deis duit chun é a cheartú le linn an agallaimh

source: The international protection officer will examine your application, to decide what to recommend in your case. The 3 options for the recommendation are:
ga: • Féadann tú aon fhianaise dhoiciméadach a chur isteach nó aighneachtaí scríofa eile a dhéanamh chun tacú le d’éileamh roimh, nó ag d’agallamh

source: • That you should be given a refugee declaration or
ga: • Is í an t-aon fheidhm amháin a bhíonn ag an teangaire ná ceisteanna an agallóra agus d’fhreagraí a mhíniú go cruinn agus go litriúil

source: • That you should be given a subsidiary protection declaration or
ga: Ní thairgeoidh an teangaire comhairle duit ná ní chuirfidh sé nó sí aon tuairim in iúl faoi fhiúntas do cháis

source: • That you should be given neither of these declarations
ga: Is feasach don teangaire go ndéantar an t-agallamh faoi rún

source: You will be interviewed as part of the examination of your application
ga: • Más mian leat ionadaí dlíthiúil a thabhairt leat, is gnách go ligfear dó nó di bheith i láthair ag an agallamh mar bhreathnóir

source: You will be notified in writing of a time, a date and a place to attend for a personal interview
ga: Tabharfar deis do d’ionadaí dlíthiúil ag deireadh an agallaimh chun aon phointí a mheastar a bheith riachtanach a chur in iúl

source: If you do not attend for a personal interview on a date and at a time fixed and you do not provide the Minister for Justice and Equality with an explanation (not later than 3 working days from that date) that is reasonable in the opinion of the Minister, your application will be considered based only on information you have already provided
ga: • Níl aon saoráidí ann do leanaí in Oifig an Choimisinéara Iarratais do Dhídeanaithe, mar sin ba chóir duit féin socrúcháin a dhéanamh go dtabharfaí cúram do do leanaí le linn duit a bheith ag freastal ar agallamh

source: If you require an interpreter, every reasonable effort will be made to provide one in a language that you can use
ga: • Ba cheart duit gach faisnéis ábhartha do d’iarratas a chur ar fáil don Choimisinéir Iarratais do Dhídeanaithe

source: There may not be a personal interview if the international protection officer considers that:
ga: Breithneoidh an Coimisinéir nó Bínse Achomhairc Dídeanaithe an méid seo a leanas agus do chreidiúnacht á meas i ndáil le d’iarratas ar stádas dhídeanaí:

source: • Based on the available evidence, the applicant should be given a refugee declaration
ga: • an bhfuil cáipéisí aitheantais agat nó an dtugann tú míniú réasúnta as gan iad a bheith agatω

source: • An applicant aged under 18 is not mature enough for an interview to be useful
ga: • an dtugann tú míniú réasúnta ar aon éileamh gurb í Éire an chéad tír shábháilte ar tháinig tú chuici tar éis duit do thír féin a fhágáilω

source: • The applicant is unfit or unable to be interviewed due to enduring circumstances beyond their control
ga: • ar sholáthraigh tú míniú iomlán agus fírinneach faoin gcaoi ar thaistil agus ar tháinig tú go hÉirinnω

source: Following the interview, the international protection officer will prepare a written report. Recommendation of the international protection officer
ga: • mura ndearna tú iarratas go láithreach ar do theacht ag pointe iontrála go hÉirinn, ar thug tú míniú réasúnta ina leith sinω

source: At the end of the examination, the international protection officer will prepare a written report, which will include a recommendation on your application
ga: • má rinne tú cáipéisí aitheantais nó eile a bhrionnú, a scriosadh nó a dhiúscairt, ar thug tú míniú réasúnta ina leith sinω

source: The report will be based on the matters that you have raised, both in writing and at your interview
ga: • an ndearna tú d’iarratas in athuair tar éis duit aistarraingt roimhe sin, gan cúis réasúntaω

source: The report will also take into account other matters that the officer considers appropriate, for example, information in relation to the situation in your country of origin or representations made by the United Nations High Commissioner for Refugees (UNHCR) in connection with your application
ga: • an ndearna tú iarratas ar thearmann tar éis tús an phróisis dhíbearthaω • ar chloígh tú leis an dualgas chun comhoibriú i bhfiosrú do cháis, chun faisnéis ábhartha a sholáthar ag an deis is luaithe agus is féidir, gan an Stát a fhágáil gan comhthoil an Aire Dhlí agus Chirt, chun an Coimisinéir a choinneáil ar an eolas faoi do sheoladh nó chun cloí le haon riachtanas chun cónaí ag áit ar leith nó chun tuairisciú chuig duine ainmnitheω

source: The international protection officer’s recommendation, under section 39 (3) of the Act, will be one of the following:
ga: • an bhfuil tú ag cur faisnéis nua chun cinn ar achomharc arbh fhéidir a thabhairt don Choimisinéir ach nár tugadhω

source: (b) You should not be given a refugee declaration and should be given a subsidiary protection declaration
ga: Bunófar an tuairisc sin ar na hábhair a thug tú aníos i scríbhinn agus ó bhéil ag d’agallamh

source: (c) You should be given neither a refugee declaration nor a subsidiary protection declaration
ga: Tabharfaidh an tuairisc san áireamh ábhair eile a mheasann an t-oifigeach a bheith iomchuí, mar shampla, faisnéis i ndáil le cúinsí i do thír bhunaidh nó ionadaíochtaí déanta ag an UNHCR i ndáil le d’iarratas. Seolfar cóip den tuairisc seo chugatsa

source: The report will be sent to the Minister for Justice and Equality, who will send you written notification of the recommendation
ga: Moltaí ag an gCoimisinéir Iarratais do Dhídeanaithe

source: If the international protection officer recommends that you should be given a refugee declaration, the Minister for Justice and Equality will give you this declaration
ga: Sa chás go bhfaigheann d’iarratas ar dhearbhú mar dhídeanaí moladh dearfach ón gCoimisinéir Iarratais do Dhídeanaithe, cuirfear do mholadh faoi bhráid an Aire Dlí agus Cirt a dhéanfaidh dearbhú gur dídeanaí tú

source: You can read more in our document on decisions on international protection made by the Minister for Justice and Equality
ga: Tabharfar dearbhú duit i scríbhinn ag maíomh gur dídeanaí tú

source: If the international protection officer recommends that you should be given either a subsidiary protection declaration or no declaration, a copy of the report will be sent to you. You may appeal to the International Protection Appeals Tribunal against the recommendation
ga: Sa chás ina ndéanann an Coimisinéir Iarratais do Dhídeanaithe moladh nár cheart tú a dhearbhú mar dhídeanaí, is iondúil go bhféadfá achomharc a thógáil chuig an mBinse Achomhairc do Dhídeanaithe i gcoinne an mholta laistigh de 15 lá oibre ó sheoladh an fhógra

source: You can read more about this in our document, If your application for international protection in Ireland is refused
ga: Is féidir tuilleadh faisnéise a fháil inár ndoiciméad, Má dhiúltaítear do d'iarratas ar stádas dídeanaí
